{
  "stocks": [
    {
      "name": "Facebook Inc",
      "symbol": "FB",
      "description": "Facebook, Inc. operates as a mobile application and Website that enables people to connect, share, discover, and communicate each other on mobile devices and personal computers worldwide. Its solutions also include Instagram, a mobile application that enables people to take photos or videos, customize them with filter effects, and share them with friends and followers in a photo feed or send them directly to friends; Messenger, a messaging application for mobile and Web on various platforms and devices, which enable people to reach others instantly, as well as enable businesses to engage with customers; and WhatsApp Messenger, a mobile messaging application. The company also develops Oculus virtual reality technology and content platform, which allow people to enter an immersive and interactive environment to play games, consume content, and connect with others. As of December 31, 2015, it had 1.04 billion daily active users (DAUs) and 934 million DAUs who accessed Facebook from a mobile device. Facebook, Inc. was founded in 2004 and is headquartered in Menlo Park, California.",
      "stock_exchange": "NasdaqGS",
      "url": "http://www.facebook.com",
      "ceo": "Mark Elliot Zuckerberg"
    },
    {
      "name": "Cisco Systems Inc",
      "symbol": "CSCO",
      "description": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol (IP) based networking and other products related to the communications and information technology industry worldwide. It provides switching products, including fixed-configuration and modular switches, and storage products that provide connectivity to end users, workstations, IP phones, wireless access points, and servers; and next-generation network routing products that interconnect public and private wireline and mobile networks for mobile, data, voice, and video applications. The company also offers service provider video infrastructure, including set-top boxes, cable/telecommunications access products, and cable modems; and video software and solutions. In addition, it provides collaboration products comprising unified communications products, conferencing products, telepresence systems, and enterprise mobile messaging products; data center products, such as blade and rack servers, modular servers, fabric interconnects, software, and server access virtualization solutions; security products, including network and data center security, advanced threat protection, Web and email security, access and policy, unified threat management, and advisory, integration, and managed services; and other products, such as emerging technologies and other networking products. Further, the company offers wireless products consisting of wireless access points; network managed services; and standalone, switch-converged, and cloud managed solutions. Additionally, it provides technical support services and advanced services. The company serves businesses of various sizes, public institutions, governments, and communications service providers. Cisco Systems, Inc. sells its products directly, as well as through channel partners, such as systems integrators, service providers, other resellers, and distributors. The company was founded in 1984 and is headquartered in San Jose, California.",
      "stock_exchange": "NasdaqGS",
      "url": "http://www.cisco.com",
      "ceo": "Charles H. Robbins"
    },
    {
      "name": "Walt Disney Co",
      "symbol": "DIS",
      "description": "The Walt Disney Company, together with its subsidiaries, operates as an entertainment company worldwide. The company operates broadcast and cable television networks, domestic television stations, and radio networks and stations; and is involved in the television production and television distribution operations. Its cable networks include ESPN, Disney Channels, and ABC Family, as well as UTV/Bindass and Hungama. The company owns eight domestic television stations. It also owns and operates the Walt Disney World Resort in Florida that includes theme parks; hotels; vacation club properties; a retail, dining, and entertainment complex; a sports complex; conference centers; campgrounds; golf courses; water parks; and other recreational facilities. In addition, the company operates Disneyland Resort in California; Disney Resort & Spa in Hawaii; Disney Vacation Club, Disney Cruise Line, and Adventures by Disney; and Disneyland Paris, Hong Kong Disneyland Resort, and Shanghai Disney Resort, as well as licenses its intellectual property to a third party for the operations of the Tokyo Disney Resort in Japan. Further, it produces and acquires live-action and animated motion pictures, direct-to-video content, musical recordings, and live stage plays; licenses trade names, characters, and visual and literary properties to retailers and publishers; publishes entertainment and educational books, magazines, and comic books; and operates English language learning centers in China. Additionally, the company is involved in the sale of merchandise through its retail stores, Internet shopping sites, and wholesale business. In addition, it creates and distributes entertainment and lifestyle content for interactive media platforms. The company was founded in 1923 and is based in Burbank, California.",
      "stock_exchange": "NYSE",
      "url": "http://www.thewaltdisneycompany.com",
      "ceo": "Robert A. Iger"
    },
    {
      "name": "Amazon.com Inc",
      "symbol": "AMZN",
      "description": "Amazon.com, Inc. engages in the retail sale of consumer products in North America and internationally. It operates through the North America, International, and Amazon Web Services (AWS) segments. The company sells merchandise and content purchased for resale from vendors, as well as those offered by third-party sellers through retail Websites, such as amazon.com, amazon.ca, amazon.com.mx, amazon.com.au, amazon.com.br, amazon.cn, amazon.fr, amazon.de, amazon.in, amazon.it, amazon.co.jp, amazon.nl, amazon.es, and amazon.co.uk. It also manufactures and sells electronic devices, including kindle e-readers, fire tablets, fire TVs, and echo, as well as fire phones; and provides Kindle Direct Publishing, an online platform that allows independent authors and publishers to make their books available in the Kindle Store. In addition, the company offers programs that enable sellers to sell their products on its Websites, as well as their own branded Websites; and programs that allow authors, musicians, filmmakers, app developers, and others to publish and sell content. Further, it offers compute, storage, database, and other AWS services, as well as fulfillment, publishing, digital content subscriptions, advertising, and co-branded credit card agreements services. Additionally, the company offers Amazon Prime, an annual membership program, which provides free shipping of various items; access to unlimited streaming of movies and TV episodes; and other services. It serves consumers, sellers, developers, enterprises, and content creators. The company was founded in 1994 and is headquartered in Seattle, Washington.",
      "stock_exchange": "NasdaqGS",
      "url": "http://www.amazon.com",
      "ceo": "Jeffrey P. Bezos"
    },
    {
      "name": "Apple Inc",
      "symbol": "AAPL",
      "description": "Apple Inc. designs, manufactures, and markets mobile communication and media devices, personal computers, and portable digital music players to consumers, small and mid-sized businesses, education, and enterprise and government customers worldwide. The company also sells related software, services, accessories, networking solutions, and third-party digital content and applications. It offers iPhone, a line of smartphones; iPad, a line of multi-purpose tablets; and Mac, a line of desktop and portable personal computers. The company also provides iLife, a consumer-oriented digital lifestyle software application suite; iWork, an integrated productivity suite that helps users create, present, and publish documents, presentations, and spreadsheets; and other application software, such as Final Cut Pro, Logic Pro X, and FileMaker Pro. In addition, it offers Apple TV that connects to consumers' TV and enables them to access digital content directly for streaming high definition video, playing music and games, and viewing photos; Apple Watch, a personal electronic device; and iPod, a line of portable digital music and media players. Further, the company sells Apple-branded and third-party Mac-compatible, and iOS-compatible accessories, such as headphones, displays, storage devices, Beats products, and other connectivity and computing products and supplies. Additionally, it offers iCloud, a cloud service; AppleCare that offers support options for its customers; and Apple Pay, a mobile payment service. The company sells and delivers digital content and applications through the iTunes Store, App Store, iBooks Store, Mac App Store, and Apple Music. It also sells its products through its retail and online stores, and direct sales force, as well as through third-party cellular network carriers, wholesalers, retailers, and value-added resellers. Apple Inc. was founded in 1977 and is headquartered in Cupertino, California.",
      "stock_exchange": "NasdaqGS",
      "url": "http://www.apple.com",
      "ceo": "Tim Cook"
    },
    {
      "name": "Intel Corp",
      "symbol": "INTC",
      "description": "Intel Corporation designs, manufactures, and sells integrated digital technology platforms worldwide. It operates through Client Computing Group, Data Center Group, Internet of Things Group, Software and Services, and All Other segments. The company's platforms are used in various computing applications comprising notebooks, 2 in 1 systems, desktops, servers, tablets, smartphones, wireless and wired connectivity products, wearables, retail devices, and manufacturing devices, as well as for retail, transportation, industrial, buildings, home use, and other market segments. It offers microprocessors that processes system data and controls other devices in the system; chipsets, which send data between the microprocessor and input, display, and storage devices, such as keyboard, mouse, monitor, hard drive or solid-state drive, and optical disc drives; and system-on-chip products that integrate its central processing units with other system components onto a single chip. The company also provides communication and connectivity offerings, such as baseband processors, radio frequency transceivers, and power management integrated circuits; and tablet, phone, and Internet of Things solutions, which include multimode 4G LTE modems, Bluetooth technology and GPS receivers, software solutions, and interoperability tests, as well as home gateway and set-top box components. In addition, it offers security solutions for computers, mobile devices, and networks, as well as software and services for technology integration; NAND flash memory products, which are used in solid-state drives; and custom foundry services, including custom silicon, packaging, and manufacturing test services. The company sells its products primarily to original equipment manufacturers, original design manufacturers, and industrial and communications equipment manufacturers in the computing and communications industries. Intel Corporation was founded in 1968 and is based in Santa Clara, California.",
      "stock_exchange": "NasdaqGS",
      "url": "http://www.intel.com",
      "ceo": "Brian M. Krzanich"
    },
    {
      "name": "International Business Machines Corp",
      "symbol": "IBM",
      "description": "International Business Machines Corporation provides information technology (IT) products and services worldwide. The company's Global Technology Services segment provides IT infrastructure services, such as IT outsourcing, integrated technology, cloud, and technology support services. Its Global Business Services segment offers consulting and systems integration services for strategy and transformation, application innovation services, enterprise applications, and analytics; application management, maintenance, and support services; and processing platforms and business process outsourcing services. The company's Software segment provides middleware and operating systems software, including WebSphere software to integrate and manage business processes; information management software that enables clients to integrate, manage, and analyze data from various sources; Tivoli software that manages business infrastructure in real time; Workforce Solutions, which enables businesses to connect people and processes; and Rational software that supports software development. This segment also provides Watson software to interact in natural language, process big data, and learn from interactions with people and computers; Watson Health that offers data analytics and insights of individual health; and Watson Internet of Things that allows direct sensing and communication of data. Its Systems Hardware segment offers infrastructure technologies, such as servers for businesses, organizations, and technical computing applications; and data storage products and solutions. The company's Global Financing segment provides lease and loan financing; commercial financing to suppliers, distributors, and remarketers; and remanufacturing and remarketing services. The company was formerly known as Computing-Tabulating-Recording Co. and changed its name to International Business Machines Corporation in 1924. The company was founded in 1910 and is headquartered in Armonk, New York.",
      "stock_exchange": "NYSE",
      "url": "http://www.ibm.com",
      "ceo": "Ginni Rometty"
    },
    {
      "name": "Alphabet Inc",
      "symbol": "GOOGL",
      "description": "Alphabet Inc., through its subsidiaries, provides online advertising services in the United States, the United Kingdom, and rest of the world. The company offers performance and brand advertising services. It operates through Google and Other Bets segments. The Google segment includes principal Internet products, such as Search, Ads, Commerce, Maps, YouTube, Apps, Cloud, Android, Chrome, and Google Play, as well as technical infrastructure and newer efforts, such as Virtual Reality. This segment also sells hardware products comprising Chromecast, Chromebooks, and Nexus. The Other Bets segment includes businesses, such as Access/Google Fiber, Calico, Nest, Verily, GV, Google Capital, X, and other initiatives. Alphabet Inc. was founded in 1998 and is headquartered in Mountain View, California.",
      "stock_exchange": "NasdaqGS",
      "url": "http://abc.xyz",
      "ceo": "Lawrence E. Page"
    },
    {
      "name": "McDonald's Corp",
      "symbol": "MCD",
      "description": "McDonald's Corporation operates and franchises McDonald's restaurants in the United States, Europe, the Asia/Pacific, the Middle East, Africa, Canada, and Latin America. The company's restaurants offer various food products, soft drinks, coffee, and other beverages. As of December 31, 2015, it operated 36,525 restaurants, including 30,081 franchised restaurants comprising 21,147 franchised to conventional franchisees, 5,529 licensed to developmental licensees, and 3,405 licensed to foreign affiliates; and 6,444 company-operated restaurants. The company was founded in 1940 and is based in Oak Brook, Illinois.",
      "stock_exchange": "NYSE",
      "url": "http://www.aboutmcdonalds.com",
      "ceo": "Stephen J. Easterbrook"
    },
    {
      "name": "3M Co",
      "symbol": "MMM",
      "description": "3M Company operates as a diversified technology company worldwide. The company's Industrial segment offers tapes; coated, non-woven, and bonded abrasives; adhesives; ceramics; sealants; specialty materials; filtration products; closure systems for personal hygiene products; acoustic systems products; automotive components; abrasion-resistant films; structural adhesives; and paint finishing and detailing products. Its Safety and Graphics segment provides personal protection products, traffic safety and security products, commercial graphics systems, commercial cleaning and protection products, floor matting, roofing granules, and fall protection products. The company's Health Care segment offers medical and surgical supplies, skin health and infection prevention products, drug delivery systems, dental and orthodontic products, health information systems, and food safety products. Its Electronics and Energy segment provides optical films; packaging and interconnection devices; insulating and splicing solutions; touch screens and touch monitors; renewable energy component solutions; and infrastructure protection products. The company's Consumer segment offers sponges, scouring pads, high-performance cloths, consumer and office tapes, repositionable notes, indexing systems, construction and home improvement products, home care products, protective material products, and consumer and office tapes and adhesives. 3M Company serves automotive, electronics and energy, appliance, paper and printing, packaging, food and beverage, construction, clinics and hospitals, pharmaceuticals, dental and orthodontic practitioners, health information systems, food manufacturing and testing, consumer and office retail, home improvement, drug and pharmacy retail, and other markets. The company sells its products through wholesalers, retailers, jobbers, distributors, and dealers, as well as directly to users. 3M Company was founded in 1902 and is headquartered in St. Paul, Minnesota.",
      "stock_exchange": "NYSE",
      "url": "http://www.3m.com",
      "ceo": "Inge G. Thulin"
    },
    {
      "name": "Microsoft Corp",
      "symbol": "MSFT",
      "description": "Microsoft Corporation, a technology company, develops, licenses, and supports software products, services, and devices worldwide. The company's Devices and Consumer (D&C) Licensing segment licenses Windows operating system and related software; Microsoft Office for consumers; and Windows Phone operating system. Its Computing and Gaming Hardware segment provides Xbox gaming and entertainment consoles and accessories, second-party and third-party video games, and Xbox Live subscriptions; surface devices and accessories; and Microsoft PC accessories. The company's Phone Hardware segment offers Lumia phones and other non-Lumia phones. Its D&C Other segment provides Windows Store and Xbox marketplace; search advertising; display advertising; Office 365 Home and Office 365 Personal; first-party video games; and other consumer products and services, as well as operates retail stores. The company's Commercial Licensing segments licenses server products, including Windows Server, Microsoft SQL Server, Visual Studio, System Center, and related Client Access Licenses (CALs); Windows Embedded; Windows operating system; Microsoft Office for business, such as Office, Exchange, SharePoint, and related CALs; Microsoft Dynamics business solutions; and Skype. Its Commercial Other segment offers enterprise services, including premier support services and Microsoft consulting services; commercial cloud comprising Office 365 Commercial, other Microsoft Office online offerings, Dynamics CRM Online, and Microsoft Azure; and other commercial products and online services. The company markets and distributes its products through original equipment manufacturers, distributors, and resellers, as well as through online and Microsoft retail stores. Microsoft Corporation was founded in 1975 and is based in Redmond, Washington.",
      "stock_exchange": "NasdaqGS",
      "url": "http://www.microsoft.com",
      "ceo": "Satya Nadella"
    },
    {
      "name": "Netflix Inc",
      "symbol": "NFLX",
      "description": "Netflix, Inc., an Internet television network, engages in the Internet delivery of television (TV) shows and movies on various Internet-connected screens. The Company operates in three segments: Domestic streaming, International streaming and Domestic DVD. It offer members with the ability to receive TV shows and movies streaming content, including original series, documentaries, and feature films through a host of Internet-connected screens, such as TVs, digital video players, TV set-top boxes, and mobile devices. The company also provides DVDs-by-mail membership services. It serves approximately 75 million members in 190 countries. Netflix, Inc. was founded in 1997 and is headquartered in Los Gatos, California.",
      "stock_exchange": "NasdaqGS",
      "url": "http://www.netflix.com",
      "ceo": "Reed Hastings"
    },
    {
      "name": "Visa Inc",
      "symbol": "V",
      "description": "Visa Inc., a payments technology company, operates an open-loop payments network worldwide. The company facilitates commerce through the transfer of value and information among financial institutions, merchants, consumers, businesses, and government entities. It operates VisaNet, a processing network that enables authorization, clearing, and settlement of payment transactions; and offers fraud protection for account holders and assured payment for merchants. The company also provides a suite of digital, ecommerce, person-to-person payments, and mobile products and services. In addition, it offers merchant gateway services for ecommerce merchants to accept, process, and reconcile payments; manage fraud; and safeguard payment security online, as well as processing services for participating issuers of visa debit, prepaid, and ATM payment products. The company provides its services under the Visa, Visa Electron, Interlink, and PLUS brands. Visa Inc. has a strategic alliance with Bottomline Technologies. The company was incorporated in 2007 and is headquartered in San Francisco, California.",
      "stock_exchange": "NYSE",
      "url": "http://www.visa.com",
      "ceo": "Charles W. Scharf"
    },
    {
      "name": "NVIDIA Corp",
      "symbol": "NVDA",
      "description": "NVIDIA Corporation operates as a visual computing company worldwide. It operates in two segments, GPU and Tegra Processor. The GPU segment offers processors, which include GeForce for PC gaming; Quadro for design professionals working in computer-aided design, video editing, special effects, and other creative applications; Tesla for deep learning, accelerated computing, and general purpose computing; and GRID for cloud-based streaming on gaming devices. The Tegra Processor segment provides processors that integrate a computer onto a single chip under the Tegra brand name; DRIVE automotive computers, which offer supercomputing capabilities; and tablet and portable devices for mobile gaming under the SHIELD name. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. It sells its products primarily to original equipment manufacturers, original design manufacturers, system builders, motherboard manufacturers, add-in board manufacturers, and retailers/distributors. NVIDIA Corporation was founded in 1993 and is headquartered in Santa Clara, California.",
      "stock_exchange": "NasdaqGS",
      "url": "http://www.nvidia.com",
      "ceo": "Jen-Hsun Huang"
    },
    {
      "name": "Pfizer Inc",
      "symbol": "PFE",
      "description": "Pfizer Inc., a biopharmaceutical company, discovers, develops, manufactures, and sells healthcare products worldwide. The company operates through Global Innovative Pharmaceutical (GIP); Global Vaccines, Oncology and Consumer Healthcare (VOC); and Global Established Pharmaceutical (GEP) segments. The GIP segment develops and commercializes medicines for various therapeutic areas, including inflammation/immunology, cardiovascular/metabolic, neuroscience/pain, and rare diseases. The VOC segment develops and commercializes vaccines, as well as products for oncology and consumer healthcare. It provides over-the-counter products comprising dietary supplements under the Centrum, Caltrate, and Emergen-C brands; pain management products under the Advil and ThermaCare brands; gastrointestinal products under the Nexium 24HR/Nexium Control and Preparation H brands; and respiratory and personal care products under the brand names of Robitussin, Advil Cold & Sinus, Advil Sinus Congestion Relief & Pain, Dimetapp, and ChapStick. The GEP segment offers products that have lost marketing exclusivity in various markets; and branded generics, generic sterile injectable products, biosimilars, infusion systems, and other products. The company serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, and individual provider offices, as well as centers for disease control and prevention. It has licensing agreements with Cellectis SA and AstraZeneca PLC; and collaborative agreements with Eli Lilly & Company, OPKO Health, Inc., BioRap Technologies LTD., and Merck KGaA. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.",
      "stock_exchange": "NYSE",
      "url": "http://www.pfizer.com",
      "ceo": "Ian C. Read"
    },
    {
      "name": "Tesla Motors Inc",
      "symbol": "TSLA",
      "description": "Tesla Motors, Inc. designs, develops, manufactures, and sells electric vehicles and stationary energy storage products in the United States, China, Norway, and internationally. It primarily offers sedans and sport utility vehicles. The company also offers electric vehicle powertrain components and systems to other manufacturers. Tesla Motors, Inc. sells its products through a network of Tesla stores and galleries, as well as through Internet. The company was founded in 2003 and is headquartered in Palo Alto, California.",
      "stock_exchange": "NasdaqGS",
      "url": "http://www.teslamotors.com",
      "ceo": "Elon Reeve Musk"
    },
    {
      "name": "Starbucks Corp",
      "symbol": "SBUX",
      "description": "Starbucks Corporation operates as a roaster, marketer, and retailer of specialty coffee worldwide. The company operates in four segments: Americas; Europe, Middle East, and Africa; China/Asia Pacific; and Channel Development. Its stores offer coffee and tea beverages, packaged roasted whole bean and ground coffees, single-serve and ready-to-drink coffee and tea products, juices, and bottled water. The company's stores also provide fresh food and snack offerings; and various food products, such as pastries, and breakfast sandwiches and lunch items, as well as serve ware, beverage-making equipment, and accessories. In addition, it licenses its trademarks through licensed stores, and grocery and national foodservice accounts. The company offers its products under the Starbucks, Teavana, Tazo, Seattle's Best Coffee, Evolution Fresh, La Boulange, Ethos, Starbucks VIA, Seattle's Best Coffee, Frappuccino, Starbucks Doubleshot, Starbucks Refreshers, and Starbucks Discoveries Iced Café Favorites brand names. As of March 27, 2016, it operated 23,921 cafes. Starbucks Corporation was founded in 1985 and is based in Seattle, Washington.",
      "stock_exchange": "NasdaqGS",
      "url": "http://www.starbucks.com",
      "ceo": "Howard S. Schultz"
    },
    {
      "name": "Texas Instruments Inc",
      "symbol": "TXN",
      "description": "Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers worldwide. It operates through two segments, Analog and Embedded Processing. The Analog segment offers high volume analog and logic products for automotive safety devices, touch screen controllers, low voltage motor drivers, and integrated motor controllers; and power management products that include catalog and application-specific standard products to enhance the efficiency of powered devices using battery management solutions, portable power conversion devices, power supply controls, and point-of-load products. This segment also provides high performance analog products, such as high-speed data converters, amplifiers, sensors, high reliability products, interface products, and precision products; and silicon valley analog products, including power management, data converter, interface, and operational amplifier catalog analog products that are used in manufacturing various electronic systems. The Embedded Processing segment offers microcontroller products, which are systems with a processor core, memory, and peripherals to control a set of specific tasks for electronic equipment; processor products comprising digital signal and applications processors; and connectivity products consisting of electronic devices to connect and transfer data. The company also provides DLP products primarily used in projectors to create high-definition images; application-specific integrated circuits; calculators; and baseband products, as well as OMAP applications processors and connectivity products. It markets and sells its products through a direct sales force and distributors. Texas Instruments Incorporated was founded in 1930 and is headquartered in Dallas, Texas.",
      "stock_exchange": "NasdaqGS",
      "url": "http://www.ti.com",
      "ceo": "Richard K. Templeton"
    },
    {
      "name": "Exxon Mobil Corp",
      "symbol": "XOM",
      "description": "Exxon Mobil Corporation explores for and produces crude oil and natural gas in the United States, Canada/South America, Europe, Africa, Asia, and Australia/Oceania. It also manufactures and markets commodity petrochemicals, including olefins, aromatics, polyethylene and polypropylene plastics, and specialty products; and transports and sells crude oil, natural gas, and petroleum products. As of December 31, 2015, the company had approximately 35,909 gross and 30,114 net operated wells. Exxon Mobil Corporation was founded in 1870 and is headquartered in Irving, Texas.",
      "stock_exchange": "NYSE",
      "url": "http://corporate.exxonmobil.com",
      "ceo": "Rex W. Tillerson"
    },
    {
      "name": "Yahoo! Inc",
      "symbol": "YHOO",
      "description": "Yahoo! Inc., together with its subsidiaries, provides search and display advertising services on Yahoo properties and affiliate sites worldwide. The company offers Yahoo Search that serves as a guide for users to discover information on the Internet; Yahoo Mail, which connects users to the people and content; and Yahoo Messenger, an instant messaging service, which enables users to connect, communicate, and share experiences in real-time. It also provides digital content products, including Yahoo News, which gives users to discover, consume, and engage around the news, content, and video; Yahoo Sports, which serves audiences of sports enthusiasts; Yahoo Finance that offers a range of financial data, information, and tools; Yahoo Lifestyle to engage users passionate about style and fashion; and Tumblr, which provides a Web platform and mobile applications on iOS and android to create, share, and curate content, as well as Tumblr messaging that enables users to engage with other users that share their same interests and passions. In addition, the company provides advertiser products, such as Yahoo Gemini, a marketplace for search and native advertising; and BrightRoll, which offers a suite of media-agnostic tools to enable advertisers, publishers, and partners connect with users across ad formats and devices. Further, it offers advertising formats; and digital advertising products, such as Yahoo native, Yahoo video, Yahoo premium, and Yahoo audience ads. Additionally, the company offers Yahoo Mobile Developer suite consisting of Flurry Analytics, Yahoo App Publishing, Yahoo App Marketing, and Tumblr In-App Sharing tools to measure, monetize, advertise, and improve their apps. Yahoo! Inc. was founded in 1994 and is headquartered in Sunnyvale, California.",
      "stock_exchange": "NasdaqGS",
      "url": "http://www.yahoo.com",
      "ceo": "Marissa Ann Mayer"
    }
  ]
}